# OverrideGraphicSettings Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings Constructor
OverrideGraphicSettings Class See Also
---
Creates a new instance of an OverrideGraphicSettings object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public OverrideGraphicSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
OverrideGraphicSettings()
```

# See Also
OverrideGraphicSettings Class
OverrideGraphicSettings Overload
Autodesk.Revit.DB Namespace